'use strict';

module.exports = {
  up: async (queryInterface, Sequelize) => {
    await queryInterface.bulkInsert('advert_type', [
      {
        name: 'оренда',
        description: 'Оголошення про оренду нерухомості або інших обʼєктів',
      },
      {
        name: 'купівля',
        description: 'Оголошення про купівлю нерухомості або інших обʼєктів',
      },
      {
        name: 'на один день',
        description: 'Оголошення для оренди або інших пропозицій на короткий термін (один день)',
      },
      {
        name: 'довгострокова оренда',
        description: 'Оголошення про оренду на тривалий термін (від кількох місяців)',
      },
      {
        name: 'комерційна нерухомість',
        description: 'Оголошення про оренду або купівлю комерційної нерухомості',
      },
      {
        name: 'житлова нерухомість',
        description: 'Оголошення про оренду або купівлю житлової нерухомості (квартири, будинки)',
      },
    ]);
  },

  down: async (queryInterface, Sequelize) => {
    await queryInterface.bulkDelete('advert_type', {
      name: {
        [Sequelize.Op.in]: ['оренда', 'купівля', 'на один день', 'довгострокова оренда', 'комерційна нерухомість', 'житлова нерухомість'],
      },
    });
  },
};
